Revit 2025 API
AccessLevel Enumeration
 Defines access levels to objects in the Extensible Storage framework.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum AccessLevel
Public Enumeration AccessLevel
public enum class AccessLevel
type AccessLevel
Members
Member name | Value | Description
Public | 1 |  Anybody has access to the object.
Vendor | 2 |  Only object vendor has access to it.
Application | 3 |  Only application that created the object has access to it.
See Also
Reference
Autodesk.Revit.DB.ExtensibleStorage Namespace